doc: architecture
